Ebiroll/qemu-stm32/hw/arm/stm32/stm32l552_rcc.c
/*
 * STM32 Microcontroller RCC (Reset and Clock Control) module
 *
 * Copyright (C) 2023 Olof Astrand
 *
 * Source code based on omap_clk.c
 * Implementation based on ST Microelectronics "RM0008 Reference Manual Rev 10"
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as
 * published by the Free Software Foundation; either version 2 of
 * the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#include "qemu/osdep.h"
#include "qapi/error.h"
#include "cpu.h"

#include "qemu/timer.h"
#include <stdio.h>

#include "hw/sysbus.h"
#include "hw/hw.h"
#include "hw/irq.h"
#include "stm32fxxx_clktree.h"
#include "stm32l552_rcc.h"
#include "qemu/log.h"
//#include "hw/arm/armv7m.h"
#include "migration/vmstate.h"
#include "hw/qdev-properties.h"


extern int system_clock_scale;

/* DEFINITIONS*/

/* See README for DEBUG details. */
#define DEBUG_STM32_RCC

#ifdef DEBUG_STM32_RCC
#define DPRINTF(fmt, ...)                                       \
do { printf("STM32L552_RCC: " fmt , ## __VA_ARGS__); } while (0)
#else
#define DPRINTF(fmt, ...)
#endif

#define IS_RESET_VALUE(new_value, mask, reset_value) ((new_value & mask) == (mask & reset_value))

#define WARN_UNIMPLEMENTED(new_value, mask, reset_value) \
    if (!IS_RESET_VALUE(new_value, mask, reset_value)) { \
        qemu_log_mask(LOG_UNIMP, "Not implemented: RCC " #mask ". Masked value: 0x%08x\n", (new_value & mask)); \
    }

#define WARN_UNIMPLEMENTED_REG(offset) \
        qemu_log_mask(LOG_UNIMP, "STM32l552_rcc: unimplemented register: 0x%x", (int)offset)

#define HSI_FREQ 16000000
#define LSI_FREQ 32000
/*
#define RCC_FLAG_HSIRDY                  ((uint8_t)0x21)
#define RCC_FLAG_HSERDY                  ((uint8_t)0x31)
#define RCC_FLAG_PLLRDY                  ((uint8_t)0x39)
#define RCC_FLAG_PLLI2SRDY               ((uint8_t)0x3B)
*/
// SAI & SAI1 and SAI2, 

#define RCC_CR_RESET_VALUE      0x00000063
#define RCC_CR_OFFSET           0x00
#define RCC_CR_PLLSAI2RDY_BIT   29    // SAI2 PLL clock ready flag
#define RCC_CR_PLLSAI2ON_BIT    28   // SAI2 PLL enable
#define RCC_CR_PLLSAI1RDY_BIT   27   // SAI1 PLL clock ready flag
#define RCC_CR_PLLSAI1ON_BIT    26   // SAI1 PLL enable
#define RCC_CR_PLLRDY_BIT       25   // Main PLL (PLL) clock ready flag 
#define RCC_CR_PLLON_BIT        24   // Main PLL (PLL) enable
#define RCC_CR_CSSON_BIT        19   // Clock security system enable
#define RCC_CR_HSEBYP_BIT       18   // HSE clock bypass
#define RCC_CR_HSERDY_BIT       17   // HSE clock ready flag
#define RCC_CR_HSEON_BIT        16   // HSE clock enable
#define RCC_CR_HSIASFS_BIT      11   // HSI automatic start from Stop
#define RCC_CR_HSIRDY_BIT       10   // HSI clock ready flag
#define RCC_CR_HSION_BIT        9    // HSI clock enable
#define RCC_CR_MSIRDY_BIT       1    // MSI clock ready flag
#define RCC_CR_MSION_BIT           0    // MSI clock enable

//#define RCC_CR_PLLI2SRDY_BIT    27
//#define RCC_CR_PLLI2SON_BIT     26
//#define RCC_CR_PLLRDY_BIT       25
//#define RCC_CR_PLLON_BIT        24
//#define RCC_CR_CSSON_BIT        19
//#define RCC_CR_HSEBYP_BIT       18
//#define RCC_CR_HSERDY_BIT       17
//#define RCC_CR_HSEON_BIT        16
#define RCC_CR_HSICAL_START     8
#define RCC_CR_HSICAL_MASK      0x00ff0000
#define RCC_CR_HSITRIM_START    3
#define RCC_CR_HSITRIM_MASK     0x000000f8

#define RCC_ICSCR_OFFSET         0x04
#define RCC_CFGR_RESET_VALUE     0x00000000
#define RCC_CFGR_OFFSET          0x08

//#define RCC_CFGR_MCO2_START      30
//#define RCC_CFGR_MCO2_MASK       0xC0000000
//#define RCC_CFGR_MCO2PRE_START   27
//#define RCC_CFGR_MCO2PRE_MASK    0x38000000
//#define RCC_CFGR_MCO1PRE_START   24
//#define RCC_CFGR_MCO1PRE_MASK    0x07000000
//#define RCC_CFGR_I2CSRC_BIT      23
//#define RCC_CFGR_MCO1_START      21
//#define RCC_CFGR_MCO1_MASK       0x00600000
//#define RCC_CFGR_RTCPRE_START    16
//#define RCC_CFGR_RTCPRE_MASK     0x001F0000
#define RCC_CFGR_PPRE2_START     11
#define RCC_CFGR_PPRE2_MASK      0x0000E000
#define RCC_CFGR_PPRE1_START     8
#define RCC_CFGR_PPRE1_MASK      0x00001E00
#define RCC_CFGR_HPRE_START      4
#define RCC_CFGR_HPRE_MASK       0x000000F0
#define RCC_CFGR_SWS_START       2
#define RCC_CFGR_SWS_MASK        0x0000000C
#define RCC_CFGR_SW_START        0
#define RCC_CFGR_SW_MASK         0x00000003

#define RCC_PLLCFGR_RESET_VALUE  0x00001000
#define RCC_PLLCFGR_OFFSET       0x0C
#define RCC_PLLCFGR_PLLQ_MASK    0x00300000
#define RCC_PLLCFGR_PLLQ_START   21
#define RCC_PLLCFGR_PLLSRC_BIT   0
#define RCC_PLLCFGR_PLLP_MASK    0x00030000
#define RCC_PLLCFGR_PLLP_START   17
//          <bitOffset>8</bitOffset>
//              <bitWidth>7</bitWidth>
#define RCC_PLLCFGR_PLLN_START  8
#define RCC_PLLCFGR_PLLN_MASK   0x0000003F
// SAI & SAI2
#define RCC_PLLCFGR_PLLM_START   4

#define RCC_PLLSAI1CFGR_RESET_VALUE  0x00001000
#define RCC_PLLSAI1CFGR_OFFSET       0x10


#define RCC_CIR_RESET_VALUE      0x00000000
#define RCC_CIR_OFFSET           0x20
#define RCC_CIR_CSSC_BIT         23
#define RCC_CIR_PLLI2SRDYC_BIT   21
#define RCC_CIR_PLLRDYC_BIT      20
#define RCC_CIR_HSERDYC_BIT      19
#define RCC_CIR_HSIRDYC_BIT      18
#define RCC_CIR_LSERDYC_BIT      17
#define RCC_CIR_LSIRDYC_BIT      16
#define RCC_CIR_PLLI2SRDYIE_BIT  13
#define RCC_CIR_PLLRDYIE_BIT     12
#define RCC_CIR_HSERDYIE_BIT     11
#define RCC_CIR_HSIRDYIE_BIT     10
#define RCC_CIR_LSERDYIE_BIT     9
#define RCC_CIR_LSIRDYIE_BIT     8
#define RCC_CIR_CSSF_BIT         7
#define RCC_CIR_PLLI2SRDYF_BIT  5
#define RCC_CIR_PLLRDYF_BIT     4
#define RCC_CIR_HSERDYF_BIT     3
#define RCC_CIR_HSIRDYF_BIT     2
#define RCC_CIR_LSERDYF_BIT     1
#define RCC_CIR_LSIRDYF_BIT     0

#define RCC_PLLSAI2CFGR_RESET_VALUE  0x00001000
#define RCC_PLLSAI2CFGR_OFFSET       0x14

#define RCC_CIER_RESET_VALUE      0x00000000
#define RCC_CIER_OFFSET           0x18

#define RCC_CIFR_RESET_VALUE      0x00000000
#define RCC_CIFR_OFFSET           0x1C

#define RCC_CICR_RESET_VALUE      0x00000000
#define RCC_CICR_OFFSET           0x20

#define RCC_AHB1RSTR_RESET_VALUE  0x00000000
#define RCC_AHB1RSTR_OFFSET       0x28

#define RCC_AHB2RSTR_RESET_VALUE  0x00000000
#define RCC_AHB2RSTR_OFFSET       0x2C

#define RCC_AHB3RSTR_RESET_VALUE  0x00000000
#define RCC_AHB3RSTR_OFFSET       0x30

#define RCC_APB1RSTR_RESET_VALUE  0x00000000
#define RCC_APB1RSTR_OFFSET       0x38

