Ebiroll/qemu-stm32/hw/arm/stm32/stm32l552_rcc.c
// APB1RSTR2
#define RCC_APB1RSTR2_RESET_VALUE 0x00000000
#define RCC_APB1RSTR2_OFFSET      0x3C

#define RCC_APB2RSTR_RESET_VALUE  0x00000000
#define RCC_APB2RSTR_OFFSET       0x40

#define RCC_AHB1ENR_RESET_VALUE   0x00000100
#define RCC_AHB1ENR_OFFSET        0x48

#define RCC_AHB2ENR_RESET_VALUE   0x00000000
#define RCC_AHB2ENR_OFFSET        0x4C

// AHB3ENR
#define RCC_AHB3ENR_RESET_VALUE   0x00000000
#define RCC_AHB3ENR_OFFSET        0x50

#define RCC_APB1ENR_RESET_VALUE   0x00000000
#define RCC_APB1ENR_OFFSET        0x58
// APB1ENR2
#define RCC_APB1ENR2_RESET_VALUE  0x00000000
#define RCC_APB1ENR2_OFFSET       0x5C

#define RCC_APB2ENR_RESET_VALUE   0x00000000
#define RCC_APB2ENR_OFFSET        0x60
// AHB1SMENR
#define RCC_AHB1SMENR_RESET_VALUE 0x00000000
#define RCC_AHB1SMENR_OFFSET      0x68

#define RCC_AHB2SMENR_RESET_VALUE 0x00000000
#define RCC_AHB2SMENR_OFFSET      0x6C

#define RCC_AHB3SMENR_RESET_VALUE 0x00000000
#define RCC_AHB3SMENR_OFFSET      0x70

#define RCC_APB1SMENR_RESET_VALUE 0x00000000
#define RCC_APB1SMENR_OFFSET      0x78

// APB1SMENR2
#define RCC_APB1SMENR2_RESET_VALUE 0x00A00223
#define RCC_APB1SMENR2_OFFSET      0x7C

#define RCC_APB2SMENR_RESET_VALUE 0x00000000
#define RCC_APB2SMENR_OFFSET      0x80

#define RCC_CCIPR_RESET_VALUE     0x00000000
#define RCC_CCIPR_OFFSET          0x88

#define RCC_BDCR_RESET_VALUE      0x00000000
#define RCC_BDCR_OFFSET           0x90

#define RCC_BDCR_BDRST_BIT         16
#define RCC_BDCR_RTCEN_BIT         15
#define RCC_BDCR_RTCSEL_START      8
#define RCC_BDCR_RTCSEL_MASK       0x00000300
#define RCC_BDCR_LSEBYP_BIT        2
#define RCC_BDCR_LSERDY_BIT        1
#define RCC_BDCR_LSEON_BIT         0


#define RCC_CSR_RESET_VALUE       0x0C000000
#define RCC_CSR_OFFSET            0x94
#define RCC_CSR_LPWRRSTF_BIT       31
#define RCC_CSR_WWDGRSTF_BIT       30
#define RCC_CSR_IWDGRSTF_BIT       29
#define RCC_CSR_SFTRSTF_BIT        28
#define RCC_CSR_PORRSTF_BIT        27
#define RCC_CSR_PINRSTF_BIT        26
#define RCC_CSR_BORRSTF_BIT        25
#define RCC_CSR_RMVF_BIT           24
#define RCC_CSR_LSIRDY_BIT         1
#define RCC_CSR_LSION_BIT          0


#define RCC_CRRCR_RESET_VALUE     0x00000000
#define RCC_CRRCR_OFFSET          0x98

#define RCC_CCIPR2_RESET_VALUE    0x00000000
#define RCC_CCIPR2_OFFSET         0x9C

#define RCC_SECCFGR_RESET_VALUE    0x00000000
#define RCC_SECCFGR_OFFSET         0xB8

// SECSR
#define RCC_SECSR_RESET_VALUE    0x00000000
#define RCC_SECSR_OFFSET         0xBC

// AHB1SECSR
#define RCC_AHB1SECSR_RESET_VALUE    0x00000000
#define RCC_AHB1SECSR_OFFSET         0xE8

// AHB2SECSR
#define RCC_AHB2SECSR_RESET_VALUE    0x00000000
#define RCC_AHB2SECSR_OFFSET         0xEC

// AHB3SECSR
#define RCC_AHB3SECSR_RESET_VALUE    0x00000000
#define RCC_AHB3SECSR_OFFSET         0xF0

// APB1SECSR1
#define RCC_APB1SECSR1_RESET_VALUE    0x00000000
#define RCC_APB1SECSR1_OFFSET         0xF8

// APB1SECSR2
#define RCC_APB1SECSR2_RESET_VALUE    0x00000000
#define RCC_APB1SECSR2_OFFSET         0xFC

// APB2SECSR
#define RCC_APB2SECSR_RESET_VALUE    0x00000000
#define RCC_APB2SECSR_OFFSET         0x100










#if 0

#define RCC_AHB1RSTR_OFFSET 0x10

#define RCC_AHB2RSTR_OFFSET 0x14

#define RCC_AHB3RSTR_OFFSET 0x18

#define RCC_APB1RSTR_OFFSET 0x20

#define RCC_APB2RSTR_RESET_VALUE     0x00000000
#define RCC_APB2RSTR_OFFSET          0x24
#define RCC_APB2RSTR_TIM11RST_BIT    18
#define RCC_APB2RSTR_TIM10RST_BIT    17
#define RCC_APB2RSTR_TIM9RST_BIT     16
#define RCC_APB2RSTR_SYSCFGRST       14
#define RCC_APB2RSTR_SPI1_BIT        12
#define RCC_APB2RSTR_SDIORST_BIT     11
#define RCC_APB2RSTR_ADCRST_BIT      8
#define RCC_APB2RSTR_USART6RST       5
#define RCC_APB2RSTR_USART1RST       4
#define RCC_APB2RSTR_TIM8RST_BIT     1
#define RCC_APB2RSTR_TIM1RST_BIT     0

#define RCC_AHB1ENR_RESET_VALUE      0x00000000
#define RCC_AHB1ENR_OFFSET           0x30
#define RCC_AHB1ENR_OTGHSULPIEN_BIT  30
#define RCC_AHB1ENR_OTGHSEN_BIT      29
#define RCC_AHB1ENR_ETHMACPTPEN_BIT  28
#define RCC_AHB1ENR_ETHMACRXEN_BIT   27
#define RCC_AHB1ENR_ETHMACTXEN_BIT   26
#define RCC_AHB1ENR_ETHMACEN_BIT     25
#define RCC_AHB1ENR_DMA2EN_BIT       22
#define RCC_AHB1ENR_DMA1EN_BIT       21
#define RCC_AHB1ENR_BKPSRAMEN_BIT    18
#define RCC_AHB1ENR_CRCEN_BIT        12
#define RCC_AHB1ENR_GPIOKEN_BIT      10
#define RCC_AHB1ENR_GPIOJEN_BIT      9
#define RCC_AHB1ENR_GPIOIEN_BIT      8
#define RCC_AHB1ENR_GPIOHEN_BIT      7
#define RCC_AHB1ENR_GPIOGEN_BIT      6
#define RCC_AHB1ENR_GPIOFEN_BIT      5
#define RCC_AHB1ENR_GPIOEEN_BIT      4
#define RCC_AHB1ENR_GPIODEN_BIT      3
#define RCC_AHB1ENR_GPIOCEN_BIT      2
#define RCC_AHB1ENR_GPIOBEN_BIT      1
#define RCC_AHB1ENR_GPIOAEN_BIT      0

#define RCC_AHB2ENR_OFFSET 0x34
#define RCC_AHB2ENR_DCMIEN_BIT       0
#define RCC_AHB2ENR_CRYPEN_BIT       4
#define RCC_AHB2ENR_HASHEN_BIT       5
#define RCC_AHB2ENR_RNGEN_BIT        6
#define RCC_AHB2ENR_OTGFSEN_BIT      7

#define RCC_AHB3ENR_OFFSET 0x38
#define RCC_AHB3ENR_FSMCEN_BIT       0

#define RCC_APB1ENR_RESET_VALUE  0x00000000
#define RCC_APB1ENR_OFFSET       0x40
#define RCC_APB1ENR_USART8EN_BIT 31
#define RCC_APB1ENR_USART7EN_BIT 30
#define RCC_APB1ENR_DACEN_BIT    29
#define RCC_APB1ENR_PWREN_BIT    28
#define RCC_APB1ENR_BKPEN_BIT    27
#define RCC_APB1ENR_CAN2EN_BIT   26
#define RCC_APB1ENR_CAN1EN_BIT   25
#define RCC_APB1ENR_CANEN_BIT    25
#define RCC_APB1ENR_USBEN_BIT    23
#define RCC_APB1ENR_I2C2EN_BIT   22
#define RCC_APB1ENR_I2C1EN_BIT   21
#define RCC_APB1ENR_USART5EN_BIT 20
#define RCC_APB1ENR_USART4EN_BIT 19
#define RCC_APB1ENR_USART3EN_BIT 18
#define RCC_APB1ENR_USART2EN_BIT 17
#define RCC_APB1ENR_SPI3EN_BIT   15
#define RCC_APB1ENR_SPI2EN_BIT   14
#define RCC_APB1ENR_WWDGEN_BIT   11
#define RCC_APB1ENR_TIM7EN_BIT   5
#define RCC_APB1ENR_TIM6EN_BIT   4
#define RCC_APB1ENR_TIM5EN_BIT   3
#define RCC_APB1ENR_TIM4EN_BIT   2
#define RCC_APB1ENR_TIM3EN_BIT   1
#define RCC_APB1ENR_TIM2EN_BIT   0

#define RCC_APB2ENR_RESET_VALUE  0x00000000
#define RCC_APB2ENR_OFFSET       0x44
#define RCC_APB2ENR_MASK         0x00075F33
#define RCC_APB2ENR_TIM11EN      18
#define RCC_APB2ENR_TIM10EN      17
#define RCC_APB2ENR_TIM9EN       16
#define RCC_APB2ENR_SYSCFGEN_BIT 14
#define RCC_APB2ENR_SPI1EN_BIT   12
#define RCC_APB2ENR_SDIOEN_BIT   11
#define RCC_APB2ENR_ADC3EN_BIT   10
#define RCC_APB2ENR_ADC2EN_BIT   9
#define RCC_APB2ENR_ADC1EN_BIT   8
#define RCC_APB2ENR_USART6EN_BIT 5
#define RCC_APB2ENR_USART1EN_BIT 4
#define RCC_APB2ENR_TIM8EN_BIT   1
#define RCC_APB2ENR_TIM1EN_BIT   0

#define RCC_AHB1LPENR_RESET_VALUE  0x7E6791FF
#define RCC_AHB1LPENR_OFFSET       0x50

#define RCC_AHB2LPENR_RESET_VALUE  0x000000F1
#define RCC_AHB2LPENR_OFFSET       0x54

#define RCC_AHB3LPENR_RESET_VALUE  0x00000001
#define RCC_AHB3LPENR_OFFSET       0x58

