Ebiroll/qemu-stm32/hw/arm/stm32/stm32l552_rcc.c
#define RCC_APB1LPENR_RESET_VALUE  0x36FEC9FF
#define RCC_APB1LPENR_OFFSET       0x60

#define RCC_APB2LPENR_RESET_VALUE  0x00075F33
#define RCC_APB2LPENR_OFFSET       0x64

#define RCC_BDCR_RESET_VALUE       0x00000000
#define RCC_BDCR_OFFSET            0x70

#define RCC_CSR_RESET_VALUE        0x0E000000
#define RCC_CSR_OFFSET             0x74

#define RCC_SSCGR_RESET_VALUE      0x00000000
#define RCC_SSCGR_OFFSET           0x80

#define RCC_PLLI2SCFGR_RESET_VALUE 0x20003000
#define RCC_PLLI2SCFGR_OFFSET      0x84
#define RCC_PLLI2SCFGR_PLLR_MASK    0x70000000
#define RCC_PLLI2SCFGR_PLLR_START   28
#define RCC_PLLI2SCFGR_PLLQ_MASK    0x0F000000
#define RCC_PLLI2SCFGR_PLLQ_START   24
#define RCC_PLLI2SCFGR_PLLN_MASK    0x00007FC0
#define RCC_PLLI2SCFGR_PLLN_START   6
#endif


#define PLLSRC_HSI_SELECTED 0
#define PLLSRC_HSE_SELECTED 1

#define SW_HSI_SELECTED 0
#define SW_HSE_SELECTED 1
#define SW_PLL_SELECTED 2

#define GET_BIT_MASK(position, value) ((value ? 1 : 0) << position)
#define GET_BIT_MASK_ONE(position) (1 << position)
#define GET_BIT_MASK_ZERO(position) (~(1 << position))
#define GET_BIT_VALUE(value, position) \
                ((value & GET_BIT_MASK_ONE(position)) >> position)
#define IS_BIT_SET(value, position) ((value & GET_BIT_MASK_ONE(position)) != 0)
#define IS_BIT_RESET(value, position) ((value & GET_BIT_MASK_ONE(position)) ==0)
#define RESET_BIT(var, position) var &= GET_BIT_MASK_ZERO(position)

/* Can be true, false, 0, or 1 */
#define CHANGE_BIT(var, position, new_value) \
            var = new_value ? \
                    (var | GET_BIT_MASK_ONE(position)) : \
                    (var & GET_BIT_MASK_ZERO(position))
#define CHANGE_BITS(var, start, mask, new_value) \
            var = (var & ~mask) | ((new_value << start) & mask)

# define STM32_BAD_REG(offset, size)       \
        hw_error("%s: Bad register 0x%x - size %u\n", __FUNCTION__, (int)offset, size)
# define STM32_WARN_RO_REG(offset)        \
        qemu_log_mask(LOG_GUEST_ERROR, "%s: Read-only register 0x%x\n", \
                      __FUNCTION__, (int)offset)
# define STM32_WARN_WO_REG(offset)        \
        qemu_log_mask(LOG_GUEST_ERROR, "%s: Write-only register 0x%x\n", \
                      __FUNCTION__, (int)offset)
# define STM32_NOT_IMPL_REG(offset, size)      \
        hw_error("%s: Not implemented yet 0x%x - size %u\n", __FUNCTION__, (int)offset, size)
void stm32_hw_warn(const char *fmt, ...)
    __attribute__ ((__format__ (__printf__, 1, 2)));

#define stm32_unimp(x...) qemu_log_mask(LOG_UNIMP, x)


// #define stm32f1xx_rcc STM32L552RccState
#if 0
struct stm32f1xx_rcc {
    /* Inherited */
    union {
        struct STM32FXXXRccState inherited;
        struct {
            /* Inherited */
            SysBusDevice busdev;

            /* Properties */
            uint32_t osc_freq;
            uint32_t osc32_freq;

            /* Private */
            MemoryRegion iomem;
            qemu_irq irq;
        };
    };
    
    /* Peripheral clocks */
    Clk PERIPHCLK[STM32_PERIPH_COUNT]; // MUST be first field after `inherited`, because Stm32Rcc's last field aliases this array

};
#endif

/* HELPER FUNCTIONS */
struct Clk {                                                                    
    const char *name;                                                           
                                                                                
    bool enabled;                                                               
                                                                                
    uint32_t input_freq, output_freq, max_output_freq;                          
                                                                                
    uint16_t multiplier, divisor;                                               
                                                                                
    unsigned user_count;                                                        
    qemu_irq user[CLKTREE_MAX_IRQ]; /* Who to notify on change */               
                                                                                
    unsigned output_count;                                                      
    struct Clk *output[CLKTREE_MAX_OUTPUT];                                     
                                                                                
    unsigned input_count;                                                       
    int selected_input;                                                         
    struct Clk *input[CLKTREE_MAX_INPUT];                                       
};                                                                              
                                                                                

/* Enable the peripheral clock if the specified bit is set in the value. */
/*
static void stm32_rcc_periph_enable(
                                    struct STM32L552RccState *s,
                                    uint32_t new_value,
                                    bool init,
                                    int periph,
                                    uint32_t bit_mask)
{
    printf("rcc set 0x%x %s %d %x: %sable\n", new_value, s->PERIPHCLK[periph]->name, periph, bit_mask, (new_value & (1 << bit_mask))?"en":"dis");
    clktree_set_enabled(s->PERIPHCLK[periph], (new_value & (1 << bit_mask)) != 0);
}

*/



/* REGISTER IMPLEMENTATION */

/* Read the configuration register.
   NOTE: Not implemented: CSS, PLLI2S, clock calibration and trimming. */
static uint32_t stm32_rcc_RCC_CR_read(struct STM32L552RccState *s)
{
    /* Get the status of the clocks. */
    const bool PLLON = true; // clktree_is_enabled(s->PLLCLK);
    const bool HSEON = true; //clktree_is_enabled(s->HSECLK);
    const bool HSION = true; //clktree_is_enabled(s->HSICLK);
    const bool PLLSAI1ON = true; //clktree_is_enabled(s->PLLI2SCLK);
    const bool PLLSAI2ON = true; //clktree_is_enabled(s->PLLI2SCLK);

uint32_t new_value =  GET_BIT_MASK(RCC_CR_PLLRDY_BIT, PLLON) |
        GET_BIT_MASK(RCC_CR_PLLON_BIT, PLLON) |

        GET_BIT_MASK(RCC_CR_HSERDY_BIT, HSEON) |
        GET_BIT_MASK(RCC_CR_HSEON_BIT, HSEON) |

        GET_BIT_MASK(RCC_CR_HSIRDY_BIT, HSION) |
        GET_BIT_MASK(RCC_CR_HSION_BIT, HSION) |

        GET_BIT_MASK(RCC_CR_PLLSAI1RDY_BIT, PLLSAI1ON) |
        GET_BIT_MASK(RCC_CR_PLLSAI1ON_BIT, PLLSAI2ON);

    DPRINTF("RCC_CR_read %lu \n",
                (unsigned long)new_value);
    /* build the register value based on the clock states.  If a clock is on,
     * then its ready bit is always set.
     */
    return (
        GET_BIT_MASK(RCC_CR_PLLRDY_BIT, PLLON) |
        GET_BIT_MASK(RCC_CR_PLLON_BIT, PLLON) |

        GET_BIT_MASK(RCC_CR_HSERDY_BIT, HSEON) |
        GET_BIT_MASK(RCC_CR_HSEON_BIT, HSEON) |

        GET_BIT_MASK(RCC_CR_HSIRDY_BIT, HSION) |
        GET_BIT_MASK(RCC_CR_HSION_BIT, HSION) |

        GET_BIT_MASK(RCC_CR_PLLSAI1RDY_BIT, PLLSAI1ON) |
        GET_BIT_MASK(RCC_CR_PLLSAI1ON_BIT, PLLSAI2ON)
    );
}

/* Write the Configuration Register.
 * This updates the states of the corresponding clocks.  The bit values are not
 * saved - when the register is read, its value will be built using the clock
 * states.
 */
static void stm32_rcc_RCC_CR_write(struct STM32L552RccState *s, uint32_t new_value, bool init)
{
    bool new_PLLON, new_HSEON, new_HSION, new_PLLISON;
    DPRINTF("RCC_CR_write %lu \n",
            (unsigned long)new_value);


