Ebiroll/qemu-stm32/hw/arm/stm32/stm32l552_rcc.c
/* Write the APB2 peripheral clock enable register
 * Enables/Disables the peripheral clocks based on each bit. */
static void stm32_rcc_RCC_APB2ENR_write(struct STM32L552RccState *s, uint32_t new_value,
                                        bool init)
{
    /* TODO: enable/disable missing peripherals */
   // stm32_rcc_periph_enable(s, new_value, init, STM32_SYSCFG, RCC_APB2ENR_SYSCFGEN_BIT);
   // stm32_rcc_periph_enable(s, new_value, init, STM32_UART1, RCC_APB2ENR_USART1EN_BIT);
   // stm32_rcc_periph_enable(s, new_value, init, STM32_UART6, RCC_APB2ENR_USART6EN_BIT);

    s->RCC_APB2ENR = new_value; //  & RCC_APB2ENR_MASK;
}

/* Write the APB1 peripheral clock enable register
 * Enables/Disables the peripheral clocks based on each bit. */
static void stm32_rcc_RCC_APB1ENR_write(struct STM32L552RccState *s, uint32_t new_value,
                                        bool init)
{
    //stm32_rcc_periph_enable(s, new_value, init, STM32_UART8,
    //                        RCC_APB1ENR_USART8EN_BIT);
    //stm32_rcc_periph_enable(s, new_value, init, STM32_UART7,
    //                        RCC_APB1ENR_USART7EN_BIT);
    //stm32_rcc_periph_enable(s, new_value, init, STM32_UART5,
    //                        RCC_APB1ENR_USART5EN_BIT);
    //stm32_rcc_periph_enable(s, new_value, init, STM32_UART4,
    //                        RCC_APB1ENR_USART4EN_BIT);
    //stm32_rcc_periph_enable(s, new_value, init, STM32_UART3,
    //                        RCC_APB1ENR_USART3EN_BIT);
    //stm32_rcc_periph_enable(s, new_value, init, STM32_UART2,
    //                        RCC_APB1ENR_USART2EN_BIT);

    /* 0b00110110111111101100100111111111 */
    s->RCC_APB1ENR = new_value & 0x36fec9ff;
}

static uint32_t stm32_rcc_RCC_BDCR_read(struct STM32L552RccState *s)
{
    bool lseon = clktree_is_enabled(s->LSECLK);

    return GET_BIT_MASK(RCC_BDCR_LSERDY_BIT, lseon) |
    GET_BIT_MASK(RCC_BDCR_LSEON_BIT, lseon) | 0x100; /* XXX force LSE */
}

static void stm32_rcc_RCC_BDCR_writeb0(struct STM32L552RccState *s, uint8_t new_value, bool init)
{
    clktree_set_enabled(s->LSECLK, IS_BIT_SET(new_value, RCC_BDCR_LSEON_BIT));
    
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_BDCR_LSEBYP_BIT, RCC_BDCR_RESET_VALUE);
}

static void stm32_rcc_RCC_BDCR_write(struct STM32L552RccState *s, uint32_t new_value, bool init)
{
    stm32_rcc_RCC_BDCR_writeb0(s, new_value & 0xff, init);

    WARN_UNIMPLEMENTED(new_value, 1 << RCC_BDCR_BDRST_BIT, RCC_BDCR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_BDCR_RTCEN_BIT, RCC_BDCR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, RCC_BDCR_RTCSEL_MASK, RCC_BDCR_RESET_VALUE);
}

/* Works the same way as stm32_rcc_RCC_CR_read */
static uint32_t stm32_rcc_RCC_CSR_read(struct STM32L552RccState *s)
{
    bool lseon = clktree_is_enabled(s->LSICLK);

    return GET_BIT_MASK(RCC_CSR_LSIRDY_BIT, lseon) |
    GET_BIT_MASK(RCC_CSR_LSION_BIT, lseon);
}

/* Works the same way as stm32_rcc_RCC_CR_write */
static void stm32_rcc_RCC_CSR_write(struct STM32L552RccState *s, uint32_t new_value, bool init)
{
    clktree_set_enabled(s->LSICLK, IS_BIT_SET(new_value, RCC_CSR_LSION_BIT));
}



static uint64_t stm32_rcc_readw(void *opaque, hwaddr offset)
{
    struct STM32L552RccState *s = (struct STM32L552RccState *)opaque;

    switch (offset) {
        case RCC_CR_OFFSET:
            return stm32_rcc_RCC_CR_read(s);
        case RCC_PLLCFGR_OFFSET:
            return stm32_rcc_RCC_PLLCFGR_read(s);
        case RCC_CFGR_OFFSET:
            return stm32_rcc_RCC_CFGR_read(s);
        case RCC_CIFR_OFFSET:
            return stm32_rcc_RCC_CIR_read(s);
        case RCC_AHB1RSTR_OFFSET:
            return s->RCC_AHB1RSTR;
        case RCC_AHB2RSTR_OFFSET:
            return s->RCC_AHB2RSTR;
        case RCC_AHB3RSTR_OFFSET:
            return s->RCC_AHB3RSTR;
        case RCC_APB1RSTR_OFFSET:
            return s->RCC_APB1RSTR;
        case RCC_APB2RSTR_OFFSET:
            return s->RCC_APB2RSTR;
        case RCC_AHB1ENR_OFFSET:
            return stm32_rcc_RCC_AHB1ENR_read(s);
        case RCC_AHB2ENR_OFFSET:
            return stm32_rcc_RCC_AHB2ENR_read(s);
        case RCC_AHB3ENR_OFFSET:
            return stm32_rcc_RCC_AHB3ENR_read(s);
        case RCC_APB1ENR_OFFSET:
            return s->RCC_APB1ENR;
        case RCC_APB2ENR_OFFSET:
            return s->RCC_APB2ENR;
        case RCC_BDCR_OFFSET:
            return stm32_rcc_RCC_BDCR_read(s);
        case RCC_CSR_OFFSET:
            return stm32_rcc_RCC_CSR_read(s);
        //case RCC_PLLI2SCFGR_OFFSET:
        //    return stm32_rcc_RCC_PLLI2SCFGR_read(s);
        default:
            WARN_UNIMPLEMENTED_REG(offset);
            break;
    }
    return 0;
}

static void stm32_rcc_writew(void *opaque, hwaddr offset,
                             uint64_t value)
{
    struct STM32L552RccState *s = (struct STM32L552RccState *)opaque;

    switch(offset) {
        case RCC_CR_OFFSET:
            stm32_rcc_RCC_CR_write(s, value, false);
            break;
        case RCC_PLLCFGR_OFFSET:
            stm32_rcc_RCC_PLLCFGR_write(s, value, false);
            break;
        case RCC_CFGR_OFFSET:
            stm32_rcc_RCC_CFGR_write(s, value, false);
            break;
        case RCC_CIFR_OFFSET:
            stm32_rcc_RCC_CIR_write(s, value, false);
            break;
        case RCC_APB1RSTR_OFFSET:
            s->RCC_APB1RSTR = value;
            qemu_log_mask(LOG_UNIMP, "Unimplemented write: RCC_APB1RSTR_OFFSET 0x%x\n", (uint32_t)value);
            break;
        case RCC_APB2RSTR_OFFSET:
            s->RCC_APB2RSTR = value;
            qemu_log_mask(LOG_UNIMP, "Unimplemented write: RCC_APB2RSTR_OFFSET 0x%x\n", (uint32_t)value);
            break;
        case RCC_AHB3RSTR_OFFSET:
            s->RCC_AHB3RSTR = value;
            WARN_UNIMPLEMENTED_REG(offset);
            break;
        case RCC_AHB1ENR_OFFSET:
            stm32_rcc_RCC_AHB1ENR_write(s, value, false);
            break;
        case RCC_AHB2ENR_OFFSET:
            stm32_rcc_RCC_AHB2ENR_write(s, value, false);
            break;
        case RCC_AHB3ENR_OFFSET:
            stm32_rcc_RCC_AHB3ENR_write(s, value, false);
            break;
            break;
        case RCC_APB2ENR_OFFSET:
            stm32_rcc_RCC_APB2ENR_write(s, value, false);
            break;
        case RCC_APB1ENR_OFFSET:
            stm32_rcc_RCC_APB1ENR_write(s, value, false);
            break;
        case RCC_BDCR_OFFSET:
            stm32_rcc_RCC_BDCR_write(s, value, false);
            break;
        case RCC_CSR_OFFSET:
            stm32_rcc_RCC_CSR_write(s, value, false);
            break;
        //case RCC_PLLI2SCFGR_OFFSET:
        //    stm32_rcc_RCC_PLLI2SCFGR_write(s, value, false);
        //    break;
        default:
            WARN_UNIMPLEMENTED_REG(offset);
            break;
    }
}

static uint64_t stm32_rcc_read(void *opaque, hwaddr offset,
                               unsigned size)
{
    switch(size) {
        case 4:
            return stm32_rcc_readw(opaque, offset);
        default:
            stm32_unimp("Unimplemented: RCC read from register at offset %lu", offset);
            return 0;
    }
}

static void stm32_rcc_write(void *opaque, hwaddr offset,
                            uint64_t value, unsigned size)
{
    switch(size) {
        case 4:
            stm32_rcc_writew(opaque, offset, value);
            break;
        case 1: {
            hwaddr woffset = offset & ~0x3;
            uint32_t boffset = offset & 0x3;
            uint32_t val = stm32_rcc_readw(opaque, woffset);
            val &= ~(0xff << boffset);
            val |= (value << boffset);
            stm32_rcc_writew(opaque, woffset, value);
        } break;
        default:
            WARN_UNIMPLEMENTED_REG(offset);
            break;
    }
}

